app/controllers/products_controller.rb

  def show
    @products = Product.find(params[:id])
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 0 LIMIT 1